In [1]:
print("Create DataFrames within the program")

Create DataFrames within the program

In [2]:
import pandas as pd

## 1: DF from rows, Transpose, Column Names

In [3]:
service = ["Consulting", "Installation", "Operation"]
account = ["0815", "1234", "9876"]
quantity = [10, 100, 50]
price = [100, 10, 50]
cost = [30, 7, 25]

In [4]:
myList = [service, account, quantity, price, cost]

In [5]:
#colNames = ["Service", "Account", "Quantiy", "Price", "Cost"]
colNames = [0, 1, 2]

In [6]:
df = pd.DataFrame(myList, columns = colNames)
df

            0             1          2
0  Consulting  Installation  Operation
1        0815          1234       9876
2          10           100         50
3         100            10         50
4          30             7         25

In [7]:
df = df.T
df

              0     1    2    3   4
0    Consulting  0815   10  100  30
1  Installation  1234  100   10   7
2     Operation  9876   50   50  25

In [8]:
df = df.rename(columns={0:'Service', 1:'Account',2:'Quantity', 3:'Price', 4:'Cost'})
df

        Service Account Quantity Price Cost
0    Consulting    0815       10   100   30
1  Installation    1234      100    10    7
2     Operation    9876       50    50   25

In [9]:
colNames = df.columns.values
colNames

array(['Service', 'Account', 'Quantity', 'Price', 'Cost'], dtype=object)

## 2 - Quick DF Generations

In [10]:
### Empty Dataframe
df0 = pd.DataFrame()
df0

Empty DataFrame
Columns: []
Index: []

In [11]:
### In PANDAS YOU FIRST NEED TO CREATE THE CELLS, THEN YOU CAN CHANGE THEM
accounts = ["Account_A", "Account_B", "Account_D", "Account_X"]
months = ["January", "February", "March"]
df = pd.DataFrame(index=accounts, columns=months)
df = df.fillna(0)
df

           January  February  March
Account_A        0         0      0
Account_B        0         0      0
Account_D        0         0      0
Account_X        0         0      0

In [12]:
pd.DataFrame([1,1.0], columns=["a"])

     a
0  1.0
1  1.0

In [13]:
pd.DataFrame([[0,0.1],[1.0,1]], columns=["a","b"])

     a    b
0  0.0  0.1
1  1.0  1.0

## 3 - My Website Examples

In [57]:
months = ["2021-01", "2021-02", "2021-03", "2021-04"]

In [60]:
import numpy as np
cellValues = np.random.rand(4, 4) * 1000

In [61]:
cellValues = cellValues.astype(float).round(2)

In [62]:
df = pd.DataFrame(cellValues, index=accounts, columns=months)
df

           2021-01  2021-02  2021-03  2021-04
Account_A   351.51   174.88   399.76   869.79
Account_B   597.54    63.03   360.29   463.37
Account_D   833.67   554.72   582.22   461.90
Account_X   202.50   832.42   337.22   713.16

# 4 - Pandas Dataframe: Index

In [63]:
df.reset_index()

       index  2021-01  2021-02  2021-03  2021-04
0  Account_A   351.51   174.88   399.76   869.79
1  Account_B   597.54    63.03   360.29   463.37
2  Account_D   833.67   554.72   582.22   461.90
3  Account_X   202.50   832.42   337.22   713.16

In [ ]:
# df.to_csv('mySavedDF.csv', index=False, sep=";", encoding="utf-8")